AchimPieters/ESP32-bathroom-fan/main/main.c
/**
   Copyright 2026 Achim Pieters | StudioPieters®

   Permission is hereby granted, free of charge, to any person obtaining a copy
   of this software and associated documentation files (the "Software"), to deal
   in the Software without restriction, including without limitation the rights
   to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
   copies of the Software, and to permit persons to whom the Software is
   furnished to do so, subject to the following conditions:

   The above copyright notice and this permission notice shall be included in all
   copies or substantial portions of the Software.

   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
   IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
   FITNESS FOR A PARTICULAR PURPOSE AND NON INFRINGEMENT. IN NO EVENT SHALL THE
   AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
   WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

   for more information visit https://www.studiopieters.nl
   Professional Bathroom Ventilation Controller
 **/

 #include <math.h>
 #include <stdbool.h>
 #include <stdio.h>
 #include <stdlib.h>
 #include <time.h>
 #include <sys/time.h>

 #include <driver/gpio.h>
 #include <driver/i2c.h>
 #include <esp_err.h>
 #include <esp_log.h>
 #include <esp_mac.h>
 #include <esp_system.h>
 #include <esp_netif_sntp.h>
 #include <freertos/FreeRTOS.h>
 #include <freertos/semphr.h>
 #include <freertos/task.h>
 #include <homekit/characteristics.h>
 #include <homekit/homekit.h>
 #include <nvs.h>

 #include <button.h>
 #include <sht3x.h>

 #include "esp32-lcm.h"

// ==================================================
// GPIO CONFIGURATION
// ==================================================

 #define LED_GPIO CONFIG_ESP_LED_GPIO
 #define BUTTON_GPIO CONFIG_ESP_BUTTON_GPIO

 #define FAN_LOW_GPIO CONFIG_ESP_FAN_LOW_GPIO
 #define FAN_MED_GPIO CONFIG_ESP_FAN_MED_GPIO
 #define FAN_HIGH_GPIO CONFIG_ESP_FAN_HIGH_GPIO

// ==================================================
// I2C CONFIGURATION
// ==================================================

 #define I2C_MASTER_PORT I2C_NUM_0
 #define I2C_MASTER_SCL CONFIG_I2C_MASTER_SCL
 #define I2C_MASTER_SDA CONFIG_I2C_MASTER_SDA
 #define SHT3X_ADDR CONFIG_SHT3X_I2C_ADDRESS

static const char *TAG_MAIN = "MAIN";
static const char *TAG_SENSOR = "SENSOR";

static esp_err_t i2c_master_init(void) {
        i2c_config_t conf = {
                .mode = I2C_MODE_MASTER,
                .sda_io_num = I2C_MASTER_SDA,
                .scl_io_num = I2C_MASTER_SCL,
                .sda_pullup_en = GPIO_PULLUP_ENABLE,
                .scl_pullup_en = GPIO_PULLUP_ENABLE,
                .master.clk_speed = 100000,
        };

        ESP_ERROR_CHECK(i2c_param_config(I2C_MASTER_PORT, &conf));
        return i2c_driver_install(I2C_MASTER_PORT, conf.mode, 0, 0, 0);
}

// ==================================================
// QUIET-FIRST HUMIDITY CONTROL PARAMETERS
// ==================================================

 #define HUM_OFF 58.0f
 #define HUM_LOW_ON 60.0f
 #define HUM_MID_ON 70.0f
 #define HUM_HIGH_ON 80.0f
 #define HUM_EMERGENCY 85.0f

 #define HUM_RISE_MID 10.0f
 #define HUM_RISE_HIGH 18.0f

 #define SHOWER_MIN_HUM 55.0f
 #define SHOWER_TEMP_RISE_HUM 5.0f

 #define TEMP_ON 30.0f
 #define TEMP_MID_ON 32.0f
 #define TEMP_OFF 28.0f

 #define MIN_RUNTIME_MIN 10
 #define MANUAL_TIMEOUT_MIN 20

 #define EMA_ALPHA 0.2f

// ==================================================
// SENSOR CALIBRATION
// ==================================================

 #define TEMP_OFFSET 0.8f
 #define HUM_OFFSET -10.0f

// ==================================================
// NIGHT QUIET MODE
// ==================================================

 #define NIGHT_START_HOUR 22
 #define NIGHT_END_HOUR 7

 #define NIGHT_MAX_MODE FAN_LOW

// ==================================================
// HOMEKIT SAFE NOTIFY LIMITS
// ==================================================

 #define TEMP_NOTIFY_DELTA 0.2f
 #define HUM_NOTIFY_DELTA 0.5f

 #define TEMP_MIN_NOTIFY_MS 30000
 #define HUM_MIN_NOTIFY_MS_NORMAL 15000
 #define HUM_MIN_NOTIFY_MS_SPIKE 5000

 #define MAX_EVENTS_PER_MIN_NORMAL 20
 #define MAX_EVENTS_PER_MIN_SPIKE 35

 #define HUM_SPIKE_LEVEL 70.0f

// ==================================================
// STATE
// ==================================================

typedef enum {
        FAN_OFF = 0,
        FAN_LOW,
        FAN_MID,
        FAN_HIGH,
} fan_mode_t;

static fan_mode_t fan_mode = FAN_OFF;

// Serialises access to the shared fan/control state between the HomeKit
// setter callbacks and the sensor task. Created in app_main() before either
// can run. fan_set() assumes the caller already holds this mutex.
static SemaphoreHandle_t state_mutex = NULL;

static float ema_temp = 0;
static float ema_hum = 0;
static float baseline_humidity = 0;

static bool ema_initialized = false;
static bool baseline_initialized = false;

static float last_notified_temp = 0;
static float last_notified_hum = 0;

static TickType_t last_temp_notify = 0;
static TickType_t last_hum_notify = 0;

static TickType_t minute_window_start = 0;
static uint32_t events_this_minute = 0;

static bool auto_mode = true;
static TickType_t fan_started_at = 0;
static TickType_t manual_started_at = 0;

static bool hk_fan_on = false;
static float hk_speed = 0;

static bool sntp_started = false;

// ==================================================
// HOMEKIT CHARACTERISTICS
// ==================================================

static homekit_value_t fan_on_get(void);
static void fan_on_set(homekit_value_t value);
static homekit_value_t fan_speed_get(void);
static void fan_speed_set(homekit_value_t value);

homekit_characteristic_t fan_on_characteristic =
        HOMEKIT_CHARACTERISTIC_(ON, false, .getter = fan_on_get, .setter = fan_on_set);

