AchimPieters/ESP32-bathroom-fan/main/main.c
homekit_characteristic_t fan_speed_characteristic =
        HOMEKIT_CHARACTERISTIC_(ROTATION_SPEED, 0, .getter = fan_speed_get, .setter = fan_speed_set);

homekit_characteristic_t temperature_characteristic =
        HOMEKIT_CHARACTERISTIC_(CURRENT_TEMPERATURE, 0);

homekit_characteristic_t humidity_characteristic =
        HOMEKIT_CHARACTERISTIC_(CURRENT_RELATIVE_HUMIDITY, 0);

homekit_characteristic_t name = HOMEKIT_CHARACTERISTIC_(NAME, "Bathroom Fan");
homekit_characteristic_t manufacturer = HOMEKIT_CHARACTERISTIC_(MANUFACTURER, "StudioPieters®");
homekit_characteristic_t serial = HOMEKIT_CHARACTERISTIC_(SERIAL_NUMBER, "R1TFL8J965HE");
homekit_characteristic_t model = HOMEKIT_CHARACTERISTIC_(MODEL, "TY3V0LC/Q");
homekit_characteristic_t revision =
        HOMEKIT_CHARACTERISTIC_(FIRMWARE_REVISION, LIFECYCLE_DEFAULT_FW_VERSION);
homekit_characteristic_t ota_trigger = API_OTA_TRIGGER;

// ==================================================
// TIME / SNTP
// ==================================================

static void time_sync_start(void) {
        if (sntp_started) {
                return;
        }

        setenv("TZ", "CET-1CEST,M3.5.0/2,M10.5.0/3", 1);
        tzset();

        esp_sntp_config_t config = ESP_NETIF_SNTP_DEFAULT_CONFIG("pool.ntp.org");
        esp_err_t err = esp_netif_sntp_init(&config);

        if (err == ESP_OK || err == ESP_ERR_INVALID_STATE) {
                sntp_started = true;
                ESP_LOGI(TAG_MAIN, "SNTP started");
        } else {
                ESP_LOGW(TAG_MAIN, "SNTP start failed: %s", esp_err_to_name(err));
        }
}

static bool is_night_time(void) {
        time_t now = 0;
        struct tm timeinfo = {0};

        time(&now);

        if (now < 1700000000) {
                return false;
        }

        localtime_r(&now, &timeinfo);

        int hour = timeinfo.tm_hour;

        if (NIGHT_START_HOUR > NIGHT_END_HOUR) {
                return hour >= NIGHT_START_HOUR || hour < NIGHT_END_HOUR;
        }

        return hour >= NIGHT_START_HOUR && hour < NIGHT_END_HOUR;
}

// ==================================================
// FAN CONTROL
// ==================================================

static void pulse(gpio_num_t pin) {
        gpio_set_level(pin, 0);
        vTaskDelay(pdMS_TO_TICKS(150));
        gpio_set_level(pin, 1);
}

// Caller must hold state_mutex.
static void fan_set(fan_mode_t mode) {
        if (fan_mode == mode) {
                return;
        }

        // Track the start of every OFF -> running transition (manual or auto)
        // so the minimum-runtime guarantee uses a correct reference.
        if (fan_mode == FAN_OFF && mode != FAN_OFF) {
                fan_started_at = xTaskGetTickCount();
        }

        fan_mode = mode;

        switch (mode) {
        case FAN_OFF:
                pulse(FAN_LOW_GPIO);
                hk_fan_on = false;
                hk_speed = 0;
                break;

        case FAN_LOW:
                pulse(FAN_LOW_GPIO);
                hk_fan_on = true;
                hk_speed = 30;
                break;

        case FAN_MID:
                pulse(FAN_MED_GPIO);
                hk_fan_on = true;
                hk_speed = 60;
                break;

        case FAN_HIGH:
                pulse(FAN_HIGH_GPIO);
                hk_fan_on = true;
                hk_speed = 100;
                break;
        }

        fan_on_characteristic.value = HOMEKIT_BOOL(hk_fan_on);
        fan_speed_characteristic.value = HOMEKIT_FLOAT(hk_speed);

        homekit_characteristic_notify(&fan_on_characteristic, fan_on_characteristic.value);
        homekit_characteristic_notify(&fan_speed_characteristic, fan_speed_characteristic.value);
}

// ==================================================
// IDENTIFY LED
// ==================================================

void accessory_identify(homekit_value_t value) {
        (void)value;

        for (int i = 0; i < 3; i++) {
                gpio_set_level(LED_GPIO, 1);
                vTaskDelay(pdMS_TO_TICKS(150));
                gpio_set_level(LED_GPIO, 0);
                vTaskDelay(pdMS_TO_TICKS(150));
        }
}

// ==================================================
// BUTTON CALLBACK
// ==================================================

void button_callback(button_event_t event, void *context) {
        (void)context;

        switch (event) {
        case button_event_single_press:
                lifecycle_request_update_and_reboot();
                break;

        case button_event_double_press:
                homekit_server_reset();
                esp_restart();
                break;

        case button_event_long_press:
                lifecycle_factory_reset_and_reboot();
                break;

        default:
                break;
        }
}

// ==================================================
// SAFE HOMEKIT NOTIFY
// ==================================================

// Returns true when the notification was actually sent, false when it was
// dropped by the rate limiter. Callers should only advance their
// "last notified value" when this returns true.
static bool safe_notify(homekit_characteristic_t *ch,
                        homekit_value_t value,
                        TickType_t *last_tick,
                        uint32_t min_interval_ms,
                        uint32_t max_events_per_min) {
        TickType_t now = xTaskGetTickCount();

        if ((now - minute_window_start) > pdMS_TO_TICKS(60000)) {
                minute_window_start = now;
                events_this_minute = 0;
        }

        if (events_this_minute >= max_events_per_min) {
                return false;
        }

        if ((now - *last_tick) < pdMS_TO_TICKS(min_interval_ms)) {
                return false;
        }

        homekit_characteristic_notify(ch, value);

        *last_tick = now;
        events_this_minute++;
        return true;
}

// ==================================================
// HOMEKIT FAN
// ==================================================

static homekit_value_t fan_on_get(void) {
        return HOMEKIT_BOOL(hk_fan_on);
}

static void fan_on_set(homekit_value_t value) {
        if (value.format != homekit_format_bool) {
                return;
        }

        xSemaphoreTake(state_mutex, portMAX_DELAY);

