AchimPieters/ESP32-bathroom-fan/main/main.c
        hk_fan_on = value.bool_value;
        auto_mode = false;
        manual_started_at = xTaskGetTickCount();

        if (!hk_fan_on) {
                fan_set(FAN_OFF);
                xSemaphoreGive(state_mutex);
                return;
        }

        if (hk_speed <= 0) {
                hk_speed = 30;
        }

        if (hk_speed < 40) {
                fan_set(FAN_LOW);
        } else if (hk_speed < 80) {
                fan_set(FAN_MID);
        } else {
                fan_set(FAN_HIGH);
        }

        xSemaphoreGive(state_mutex);
}

static homekit_value_t fan_speed_get(void) {
        return HOMEKIT_FLOAT(hk_speed);
}

static void fan_speed_set(homekit_value_t value) {
        if (value.format != homekit_format_float && value.format != homekit_format_int) {
                return;
        }

        xSemaphoreTake(state_mutex, portMAX_DELAY);

        hk_speed = (value.format == homekit_format_float) ? value.float_value : (float)value.int_value;
        auto_mode = false;
        manual_started_at = xTaskGetTickCount();

        if (hk_speed <= 0) {
                fan_set(FAN_OFF);
        } else if (hk_speed < 40) {
                fan_set(FAN_LOW);
        } else if (hk_speed < 80) {
                fan_set(FAN_MID);
        } else {
                fan_set(FAN_HIGH);
        }

        xSemaphoreGive(state_mutex);
}

// ==================================================
// SENSOR TASK
// ==================================================

static void sensor_task(void *arg) {
        (void)arg;

        while (1) {
                float t = 0;
                float h = 0;

                if (sht3x_read_temperature_humidity(SHT3X_ADDR, &t, &h) == ESP_OK) {
                        t += TEMP_OFFSET;
                        h += HUM_OFFSET;

                        if (h < 0.0f) {
                                h = 0.0f;
                        }

                        if (h > 100.0f) {
                                h = 100.0f;
                        }

                        if (!ema_initialized) {
                                ema_temp = t;
                                ema_hum = h;
                                ema_initialized = true;
                        } else {
                                ema_temp = EMA_ALPHA * t + (1 - EMA_ALPHA) * ema_temp;
                                ema_hum = EMA_ALPHA * h + (1 - EMA_ALPHA) * ema_hum;
                        }

                        if (fan_mode == FAN_OFF) {
                                if (!baseline_initialized) {
                                        baseline_humidity = ema_hum;
                                        baseline_initialized = true;
                                } else {
                                        baseline_humidity = baseline_humidity * 0.98f + ema_hum * 0.02f;
                                }
                        }

                        float rise = ema_hum - baseline_humidity;

                        bool spike_mode = (ema_hum >= HUM_SPIKE_LEVEL) || (rise >= HUM_RISE_MID);

                        uint32_t max_epm = spike_mode ? MAX_EVENTS_PER_MIN_SPIKE : MAX_EVENTS_PER_MIN_NORMAL;
                        uint32_t hum_interval = spike_mode ? HUM_MIN_NOTIFY_MS_SPIKE : HUM_MIN_NOTIFY_MS_NORMAL;

                        bool night_mode = is_night_time();
                        bool emergency = ema_hum >= HUM_EMERGENCY;

                        xSemaphoreTake(state_mutex, portMAX_DELAY);

                        // Emergency humidity always engages automatic control, even
                        // while a manual override is active, so the fan can clear a
                        // dangerously humid room.
                        if (auto_mode || emergency) {
                                fan_mode_t target_mode = FAN_OFF;

                                bool temp_low = ema_temp >= TEMP_ON;
                                bool temp_mid = ema_temp >= TEMP_MID_ON;

                                bool shower_detected =
                                        (rise >= HUM_RISE_MID && ema_hum >= SHOWER_MIN_HUM) ||
                                        (ema_temp >= TEMP_ON && rise >= SHOWER_TEMP_RISE_HUM) ||
                                        (ema_hum >= HUM_MID_ON);

                                bool high_needed = emergency || ema_hum >= HUM_HIGH_ON || rise >= HUM_RISE_HIGH;
                                bool mid_needed = shower_detected || temp_mid;
                                bool low_needed = ema_hum >= HUM_LOW_ON || temp_low;

                                if (high_needed) {
                                        target_mode = FAN_HIGH;
                                } else if (mid_needed) {
                                        target_mode = FAN_MID;
                                } else if (low_needed) {
                                        target_mode = FAN_LOW;
                                } else {
                                        target_mode = FAN_OFF;
                                }

                                if (night_mode && !emergency && target_mode > NIGHT_MAX_MODE) {
                                        target_mode = NIGHT_MAX_MODE;
                                }

                                uint32_t runtime =
                                        (xTaskGetTickCount() - fan_started_at) / pdMS_TO_TICKS(60000);

                                if (fan_mode != FAN_OFF && target_mode == FAN_OFF && runtime < MIN_RUNTIME_MIN) {
                                        target_mode = FAN_LOW;
                                }

                                if (fan_mode != FAN_OFF &&
                                    runtime >= MIN_RUNTIME_MIN &&
                                    ema_hum < HUM_OFF &&
                                    ema_temp < TEMP_OFF) {
                                        target_mode = FAN_OFF;
                                }

                                if (target_mode != fan_mode) {
                                        fan_set(target_mode);
                                }

