AchimPieters/ESP32-bathroom-fan/main/main.c
                                ESP_LOGI(TAG_SENSOR,
                                         "Control: Shower=%d Emergency=%d Low=%d Mid=%d High=%d Target=%d",
                                         shower_detected,
                                         emergency,
                                         low_needed,
                                         mid_needed,
                                         high_needed,
                                         target_mode);
                        } else {
                                uint32_t manual_runtime =
                                        (xTaskGetTickCount() - manual_started_at) / pdMS_TO_TICKS(60000);

                                if (manual_runtime > MANUAL_TIMEOUT_MIN) {
                                        auto_mode = true;
                                }
                        }

                        xSemaphoreGive(state_mutex);

                        if (fabsf(ema_temp - last_notified_temp) > TEMP_NOTIFY_DELTA) {
                                temperature_characteristic.value = HOMEKIT_FLOAT(ema_temp);
                                if (safe_notify(&temperature_characteristic,
                                                temperature_characteristic.value,
                                                &last_temp_notify,
                                                TEMP_MIN_NOTIFY_MS,
                                                max_epm)) {
                                        last_notified_temp = ema_temp;
                                }
                        }

                        if (fabsf(ema_hum - last_notified_hum) > HUM_NOTIFY_DELTA) {
                                humidity_characteristic.value = HOMEKIT_FLOAT(ema_hum);
                                if (safe_notify(&humidity_characteristic,
                                                humidity_characteristic.value,
                                                &last_hum_notify,
                                                hum_interval,
                                                max_epm)) {
                                        last_notified_hum = ema_hum;
                                }
                        }

                        ESP_LOGI(TAG_SENSOR,
                                 "Temp=%.2fC Hum=%.2f%% Baseline=%.2f%% Rise=%.2f%% Auto=%d Mode=%d Night=%d",
                                 ema_temp,
                                 ema_hum,
                                 baseline_humidity,
                                 rise,
                                 auto_mode,
                                 fan_mode,
                                 night_mode);

                        vTaskDelay(pdMS_TO_TICKS(spike_mode ? 3000 : 10000));
                } else {
                        ESP_LOGW(TAG_SENSOR, "SHT3X read failed, retrying in 2s");
                        vTaskDelay(pdMS_TO_TICKS(2000));
                }
        }
}

// ==================================================
// HOMEKIT ACCESSORY CONFIGURATION
// ==================================================

 #pragma GCC diagnostic push
 #pragma GCC diagnostic ignored "-Woverride-init"

homekit_accessory_t *accessories[] = {
        HOMEKIT_ACCESSORY(.id = 1,
                          .category = homekit_accessory_category_fan,
                          .services =
                                  (homekit_service_t *[]) {
                HOMEKIT_SERVICE(ACCESSORY_INFORMATION,
                                .characteristics =
                                        (homekit_characteristic_t *[]) {
                        &name,
                        &manufacturer,
                        &serial,
                        &model,
                        &revision,
                        HOMEKIT_CHARACTERISTIC(IDENTIFY,
                                               accessory_identify),
                        NULL,
                }),

                HOMEKIT_SERVICE(FAN,
                                .primary = true,
                                .characteristics =
                                        (homekit_characteristic_t *[]) {
                        HOMEKIT_CHARACTERISTIC(NAME,
                                               "Bathroom Fan"),
                        &fan_on_characteristic,
                        &fan_speed_characteristic,
                        &ota_trigger,
                        NULL,
                }),

                HOMEKIT_SERVICE(TEMPERATURE_SENSOR,
                                .characteristics =
                                        (homekit_characteristic_t *[]) {
                        HOMEKIT_CHARACTERISTIC(NAME,
                                               "Bathroom Temperature"),
                        &temperature_characteristic,
                        NULL,
                }),

                HOMEKIT_SERVICE(HUMIDITY_SENSOR,
                                .characteristics =
                                        (homekit_characteristic_t *[]) {
                        HOMEKIT_CHARACTERISTIC(
                                NAME,
                                "Bathroom Humidity"),
                        &humidity_characteristic,
                        NULL,
                }),

                NULL,
        }),
        NULL,
};

 #pragma GCC diagnostic pop

homekit_server_config_t config = {
        .accessories = accessories,
        .password = CONFIG_ESP_SETUP_CODE,
        .setupId = CONFIG_ESP_SETUP_ID,
};

static void on_wifi_ready(void) {
        static bool homekit_started = false;

        time_sync_start();

        if (homekit_started) {
                return;
        }

        homekit_server_init(&config);
        homekit_started = true;
}

// ==================================================
// MAIN
// ==================================================

void app_main(void) {
        state_mutex = xSemaphoreCreateMutex();
        if (state_mutex == NULL) {
                ESP_LOGE(TAG_MAIN, "Failed to create state mutex");
                abort();
        }

        ESP_ERROR_CHECK(lifecycle_nvs_init());
        lifecycle_log_post_reset_state(TAG_MAIN);
        ESP_ERROR_CHECK(lifecycle_configure_homekit(&revision, &ota_trigger, TAG_MAIN));

        // Derive a per-device serial number from the factory MAC so that
        // multiple units don't share an identity in the same HomeKit home.
        static char serial_number[18];
        uint8_t mac[6] = {0};
        if (esp_read_mac(mac, ESP_MAC_WIFI_STA) == ESP_OK) {
                snprintf(serial_number, sizeof(serial_number),
                         "SP-%02X%02X%02X%02X%02X%02X",
                         mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
                serial.value.string_value = serial_number;
                serial.value.is_static = true;
        }

