AchimPieters/ESP32-bathroom-fan/main/main.c
        gpio_reset_pin(LED_GPIO);
        gpio_set_direction(LED_GPIO, GPIO_MODE_OUTPUT);
        gpio_set_level(LED_GPIO, 0);

        gpio_reset_pin(FAN_LOW_GPIO);
        gpio_set_direction(FAN_LOW_GPIO, GPIO_MODE_OUTPUT_OD);
        gpio_set_level(FAN_LOW_GPIO, 1);

        gpio_reset_pin(FAN_MED_GPIO);
        gpio_set_direction(FAN_MED_GPIO, GPIO_MODE_OUTPUT_OD);
        gpio_set_level(FAN_MED_GPIO, 1);

        gpio_reset_pin(FAN_HIGH_GPIO);
        gpio_set_direction(FAN_HIGH_GPIO, GPIO_MODE_OUTPUT_OD);
        gpio_set_level(FAN_HIGH_GPIO, 1);

        gpio_reset_pin(BUTTON_GPIO);
        gpio_set_direction(BUTTON_GPIO, GPIO_MODE_INPUT);
        gpio_set_pull_mode(BUTTON_GPIO, GPIO_PULLUP_ONLY);

        button_config_t btn_cfg = {
                .active_level         = button_active_low,
                .long_press_time      = 2000,
                .repeat_press_timeout = 400,
                .max_repeat_presses   = 3,
        };

        if (button_create(BUTTON_GPIO, btn_cfg, button_callback, NULL)) {
                ESP_LOGE(TAG_MAIN, "Button init failed");
        } else {
                ESP_LOGI(TAG_MAIN,
                         "Button initialized on GPIO%d as active-low with internal pull-up",
                         BUTTON_GPIO);
        }

        ESP_ERROR_CHECK(i2c_master_init());

        esp_err_t sht_err = ESP_FAIL;
        for (int i = 0; i < 5 && sht_err != ESP_OK; i++) {
                vTaskDelay(pdMS_TO_TICKS(20));
                sht_err = sht3x_init(SHT3X_ADDR);
        }
        if (sht_err != ESP_OK) {
                ESP_LOGE(TAG_MAIN, "SHT3x init failed (%s) — sensor readings unavailable",
                         esp_err_to_name(sht_err));
        }

        xTaskCreate(sensor_task, "sensor", 4096, NULL, 5, NULL);

        esp_err_t wifi_err = wifi_start(on_wifi_ready);
        if (wifi_err == ESP_ERR_NVS_NOT_FOUND) {
                ESP_LOGW(TAG_MAIN, "WiFi provisioning data missing");
        } else if (wifi_err != ESP_OK) {
                ESP_LOGE(TAG_MAIN, "wifi_start failed: %s", esp_err_to_name(wifi_err));
        }
}
